* Jakobshavn89A
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                           | Jakobshavn89A
Place Name                            | Jakobshavn Isbræ
Geographic Location                   | Central West Greenland
Ice Type                              | Ice sheet
Data Reference                        | M. Lüthi email
Data DOI                              | 
Science Reference                     | Iken, A., Echelmeyer, Κ., Harrison, W., Funk, M.: Mechanisms of fast flow in Jakobshavns Isbræ, West Greenland: Part I. Measurements of temperature and water level in deep boreholes , Journal of Glaciology 39(131), Cambridge University Press (CUP), 15–25, 1993 
Science DOI                           | 10.3189/S0022143000015689
Date                                  | 1989
Longitude [°E]                        | -48.763000000000005
Latitude [°N]                         | 69.169
Location source                       | Colgan, 2021
Depth of top measurement [m]          | 2.0
Depth of bottom measurement [m]       | 1535.0
Ice thickness [m]                     | 1540
Coverage [% of thickness]             | 100
Ice thickness source                  | Iken1993
Measured from: Top, Bottom, Relative  | T
General_Note                          | 
Temperature_note                      | 
Thickness_note                        | 
Location_note                         | 
#+end_example

** Temperature

** Thickness

** Location

** Velocity

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -g -k1
#+END_SRC

#+RESULTS: ingest_data
|    d |      t |
|    2 |      8 |
|   20 |   -4.1 |
|  100 |  -9.05 |
|  392 | -16.45 |
|  885 |  -21.5 |
|  915 |  -21.8 |
| 1355 | -16.95 |
| 1445 |   -7.5 |
| 1535 |   -1.1 |

